Revit 2024 API
ElectricalSystem.Remove Method
Overload List
Name | Description
Remove(ConnectorSet)
Removes connectors from system.
 (Inherited from MEPSystem.)
Remove(ICollection<ElementId>)
Remove elements from system.
 (Inherited from MEPSystem.)
See Also
ElectricalSystem Class
ElectricalSystem Members
Autodesk.Revit.DB.Electrical Namespace